; domain
(define (domain fairy_house_construction)
  (:requirements :strips :typing)

  (:types
    area
    stick
    fairy_house
  )

  (:predicates
    ;; 区域相关
    (selected_area ?a - area)

    ;; 棍子相关
    (collected ?s - stick)
    (bundled ?s - stick)
    (in_formation ?s - stick)
    (tied_with_bark ?s - stick)

    ;; 房屋相关
    (built_walls ?f - fairy_house)
    (decorated ?f - fairy_house)
  )

  ;; 动作1：选择区域
  (:action find_area
    :parameters (?a - area)
    :precondition (not (selected_area ?a))
    :effect (selected_area ?a)
  )

  ;; 动作2：收集棍子
  (:action collect_sticks
    :parameters (?s - stick)
    :precondition (not (collected ?s))
    :effect (collected ?s)
  )

  ;; 动作3：捆绑棍子
  (:action bundle_sticks
    :parameters (?s - stick)
    :precondition (collected ?s)
    :effect (bundled ?s)
  )

  ;; 动作4：创建结构
  (:action create_formation
    :parameters (?s - stick)
    :precondition (bundled ?s)
    :effect (in_formation ?s)
  )

  ;; 动作5：建造墙壁
  (:action build_walls
    :parameters (?f - fairy_house ?s - stick)
    :precondition (and
                    (in_formation ?s)
                    (not (built_walls ?f))
                  )
    :effect (built_walls ?f)
  )

  ;; 动作6：使用树皮装饰
  (:action use_bark
    :parameters (?s - stick)
    :precondition (bundled ?s)
    :effect (tied_with_bark ?s)
  )

  ;; 动作7：装饰仙女屋
  (:action decorate_fairy_house
    :parameters (?f - fairy_house)
    :precondition (built_walls ?f)
    :effect (decorated ?f)
  )
)

; problem
(define (problem make_fairy_house)
  (:domain fairy_house_construction)

  (:objects
    ;; 区域
    area1 - area

    ;; 棍子
    stick1 stick2 stick3 - stick

    ;; 仙女屋
    fairy_house1 - fairy_house
  )

  (:init
    ;; 初始状态：所有对象存在，但没有任何谓词成立
    ;; 因为PDDL中的初始状态默认只有显式声明为真，其他为假
  )

  (:goal
    (and
      ;; 选择了区域
      (selected_area area1)

      ;; 收集了所有棍子
      (collected stick1)
      (collected stick2)
      (collected stick3)

      ;; 捆绑了所有棍子
      (bundled stick1)
      (bundled stick2)
      (bundled stick3)

      ;; 所有棍子已在结构中
      (in_formation stick1)
      (in_formation stick2)
      (in_formation stick3)

      ;; 仙女屋的墙壁已建造
      (built_walls fairy_house1)

      ;; 所有棍子已用树皮装饰
      (tied_with_bark stick1)
      (tied_with_bark stick2)
      (tied_with_bark stick3)

      ;; 仙女屋已装饰完成
      (decorated fairy_house1)
    )
  )
)

; plan
1. (collect_sticks stick3)
   added: (collected stick3)
   goals met: 1 of 15
2. (bundle_sticks stick3)
   added: (bundled stick3)
   goals met: 2 of 15
3. (collect_sticks stick2)
   added: (collected stick2)
   goals met: 3 of 15
4. (collect_sticks stick1)
   added: (collected stick1)
   goals met: 4 of 15
5. (create_formation stick3)
   added: (in_formation stick3)
   goals met: 5 of 15
6. (bundle_sticks stick2)
   added: (bundled stick2)
   goals met: 6 of 15
7. (bundle_sticks stick1)
   added: (bundled stick1)
   goals met: 7 of 15
8. (build_walls fairy_house1 stick3)
   added: (built_walls fairy_house1)
   goals met: 8 of 15
9. (find_area area1)
   added: (selected_area area1)
   goals met: 9 of 15
10. (use_bark stick3)
   added: (tied_with_bark stick3)
   goals met: 10 of 15
11. (create_formation stick2)
   added: (in_formation stick2)
   goals met: 11 of 15
12. (use_bark stick2)
   added: (tied_with_bark stick2)
   goals met: 12 of 15
13. (create_formation stick1)
   added: (in_formation stick1)
   goals met: 13 of 15
14. (use_bark stick1)
   added: (tied_with_bark stick1)
   goals met: 14 of 15
15. (decorate_fairy_house fairy_house1)
   added: (decorated fairy_house1)
   goals met: 15 of 15
